vishwasamadhi/stm32_pwm_output/stm32_pwm_lab8/src/cubemx_stm32f411/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define B1_Pin GPIO_PIN_13
#define B1_GPIO_Port GPIOC
#define USART_TX_Pin GPIO_PIN_2
#define USART_TX_GPIO_Port GPIOA
#define USART_RX_Pin GPIO_PIN_3
#define USART_RX_GPIO_Port GPIOA
#define LD2_Pin GPIO_PIN_5
#define LD2_GPIO_Port GPIOA
#define TMS_Pin GPIO_PIN_13
#define TMS_GPIO_Port GPIOA
#define TCK_Pin GPIO_PIN_14
#define TCK_GPIO_Port GPIOA
#define SWO_Pin GPIO_PIN_3
#define SWO_GPIO_Port GPIOB


/* USER CODE BEGIN Private defines */
#define STEPPER_PS_Pin GPIO_PIN_5
#define STEPPER_PS_GPIO_Port GPIOC
#define STEPPER_MD2_Pin GPIO_PIN_10
#define STEPPER_MD2_GPIO_Port GPIOB
#define STEPPER_DIR_Pin GPIO_PIN_6
#define STEPPER_DIR_GPIO_Port GPIOC
#define STEPPER_RST_Pin GPIO_PIN_8
#define STEPPER_RST_GPIO_Port GPIOC
#define STEPPER_ENABLE_Pin GPIO_PIN_9
#define STEPPER_ENABLE_GPIO_Port GPIOC
#define STEPPER_ATT2_Pin GPIO_PIN_3
#define STEPPER_ATT2_GPIO_Port GPIOB
#define STEPPER_MD1_Pin GPIO_PIN_4
#define STEPPER_MD1_GPIO_Port GPIOB
#define STEPPER_ATT1_Pin GPIO_PIN_5
#define STEPPER_ATT1_GPIO_Port GPIOB
/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
